Revit 2027 API
MEPAnalyticalSegment.SetOverrideType Method
 Sets the override type of pressure loss calculation.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetOverrideType(
	MEPAnalyticalModelData analyticalModel,
	SegmentOverrideType overrideType
)
Public Sub SetOverrideType (
	analyticalModel As MEPAnalyticalModelData,
	overrideType As SegmentOverrideType
)
public:
void SetOverrideType(
	MEPAnalyticalModelData^ analyticalModel,
	SegmentOverrideType overrideType
)
member SetOverrideType :
        analyticalModel : MEPAnalyticalModelData *
        overrideType : SegmentOverrideType -> unit
Parameters
analyticalModel MEPAnalyticalModelData
 The analytical model data that this segment belongs to.
overrideType SegmentOverrideType
 The new override type.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  The segment cannot be overridden for the pressure loss calculation.
See Also
Reference
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace